app/serializers/post_serializer.rb

  def comment_count
    object.comments.count
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]