app/controllers/api/v1/comment_controller.rb

INSERT INTO "comments" ("post_id", "user_id", "comment_text", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["post_id", 1], ["user_id", 1], ["comment_text", "Nice Post"], ["created_at", "2022-01-30 08:05:12.393037"], ["updated_at", "2022-01-30 08:05:12.393037"]]
---
	def create
		return generic_error unless @post
		comment = Comment.create(comment_params)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def set_resources
		@post = Post.find_by(id: params[:comment][:post_id])