app/controllers/api/v1/like_controller.rb

	def create
		return generic_error unless @post
		@like = Like.find_or_create_by(like_params)
---
INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["likeable_type", "Post"], ["likeable_id", 1], ["created_at", "2022-01-30 09:29:53.858842"], ["updated_at", "2022-01-30 09:29:53.858842"]]

	def set_resources
		@post = Post.find_by(id: params[:like][:likeable_id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]