app/controllers/api/v1/post_controller.rb

	def create
		post = Post.create(post_params)
---
INSERT INTO "posts" ("title", "user_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "New Post"], ["user_id", 1], ["description", "Hello Dear, I am here.........!"], ["created_at", "2022-01-30 07:40:17.081732"], ["updated_at", "2022-01-30 07:40:17.081732"]]

	def set_resources
		@post = Post.find_by(id: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]