app/controllers/api/v1/user_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save!
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"